## Production: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 4 to change, 5 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "911250128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::472286471787:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_policy" "firehose_waf_logs" {
        id        = "arn:aws:iam::472286471787:policy/FirehoseWafLogsPolicy"
        name      = "FirehoseWafLogsPolicy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::platform-ircc-production-waf-logs/*",
                          - "arn:aws:s3:::platform-ircc-production-waf-logs",
                          + "arn:aws:s3:::cbs-satellite-472286471787/*",
                          + "arn:aws:s3:::cbs-satellite-472286471787",
                        ]
                        # (3 unchanged elements hidden)
                    },
                    {
                        Action   = "iam:CreateServiceLinkedRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                        Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
      ~ arn            = "arn:aws:firehose:ca-central-1:472286471787:deliverystream/aws-waf-logs-platform-ircc" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:ca-central-1:472286471787:deliverystream/aws-waf-logs-platform-ircc" -> (known after apply)
      ~ name           = "aws-waf-logs-platform-ircc" -> "aws-waf-logs-platform-mvp-ca-central-1" # forces replacement
      ~ tags           = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ version_id     = "2" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-472286471787"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/472286471787/"
          + role_arn           = "arn:aws:iam::472286471787:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::platform-ircc-production-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::472286471787:role/FirehoseWafLogs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs_us_east" {
      ~ arn            = "arn:aws:firehose:us-east-1:472286471787:deliverystream/aws-waf-logs-platform-ircc-us-east" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:us-east-1:472286471787:deliverystream/aws-waf-logs-platform-ircc-us-east" -> (known after apply)
      ~ name           = "aws-waf-logs-platform-ircc-us-east" -> "aws-waf-logs-platform-mvp-us-east-1" # forces replacement
      ~ tags           = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ version_id     = "2" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-472286471787"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/472286471787/"
          + role_arn           = "arn:aws:iam::472286471787:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::platform-ircc-production-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::472286471787:role/FirehoseWafLogs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb.wordpress will be updated in-place
  ~ resource "aws_lb" "wordpress" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:472286471787:loadbalancer/app/wordpress/e5390715eaeedd67"
        name                       = "wordpress"
        tags                       = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress"
        }
        # (17 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = "platform-ircc-production-lb-logs" -> "cbs-satellite-472286471787"
          ~ prefix  = "wordpress" -> "lb_logs"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.wordpress_lb_logs will be destroyed
  - resource "aws_s3_bucket_policy" "wordpress_lb_logs" {
      - bucket = "platform-ircc-production-lb-logs" -> null
      - id     = "platform-ircc-production-lb-logs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::985666609251:root"
                        }
                      - Resource  = "arn:aws:s3:::platform-ircc-production-lb-logs/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::platform-ircc-production-lb-logs/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::platform-ircc-production-lb-logs"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_alb must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_alb" {
      ~ id                      = "arn:aws:wafv2:ca-central-1:472286471787:regional/webacl/wordpress_waf_alb/d9f0925a-e06d-416a-8831-3783493128cb" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:ca-central-1:472286471787:deliverystream/aws-waf-logs-platform-ircc",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_cloudfront must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_cloudfront" {
      ~ id                      = "arn:aws:wafv2:us-east-1:472286471787:global/webacl/wordpress_waf/2e8635c1-e246-402d-95b3-5aab34b0325f" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:us-east-1:472286471787:deliverystream/aws-waf-logs-platform-ircc-us-east",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.firehose_waf_log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "platform-ircc-production-waf-logs"
        tags                        = {
            "CostCentre" = "PlatformGCArticles"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "expire"
            tags                                   = {}
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ days                         = 90 -> 30
                # (1 unchanged attribute hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 4 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>